{
    "About": "About",
    "Resume": "Resume",
    "Services":"Services",
    "Contact": "Contact",
    "Summary": "Summary",
    "Education": "Education",
    "Resume.Today": "Today",
    "Currently working as": "Currently working as",
    "Currently in Italy": "Currently in Italy",
    "at": "at",
    "Summary.Description": "With a decade of experience in software development and in the IT world, I have been able to touch every corner of this world, starting from the development of websites, to mobile applications, to the creation of small embedded systems.",
    "About.Description": "Graduated with full marks in Computer Science from the University of Milan. I worked for years, during my school and academic studies, as a freelancer on behalf of companies and private individuals. At the same time I had the opportunity to experiment with new technologies in my free time, ranging across various areas of the sector from web apps to embedded systems. I currently hold the position of technical lead at Zerouno SRL, where I keep myself constantly updated day by day, leading a team of developers in their professional growth and taking care of implementing architectural solutions that increase company productivity and efficiency. Sideways as a hobby, I am fascinated by following the financial markets, in particular the technological sector, increasingly trying to understand what the factors that move them are and how to analyze them. Since I was a child I have always been curious, competitive and hungry both in the sporting and personal fields, I have never been satisfied with the goals achieved and it is probably also due to these characteristics that, just mentioning the professional field, I have achieved relevant corporate positions at 23 years old and completed dozens of projects.",
    "Resume.ML": "Following the first introductory course on machine learning, I am currently taking a second Google course on generative artificial intelligence.",
    "Resume.Degree": "Bachelor Degree in Computer Science",
    "University of Milan": "University of Milan",
    "Resume.Degree.Description": "After receiving a scholarship for the results achieved during the first academic year (2018-2019), I obtained, in 2021, a degree with full marks in Computer Science from the University of Milan.",
    "Professional Experience": "Professional Experience",
    "Resume.Freelancer": "Freelancer",
    "Resume.Zerouno": "Tech Lead and Software Architect mainly involved on teaching the right approach to coding and problem solving to junior devs and on maintaining and improving Zerouno major product named JPuzzle. Eliminating overengineered code that slowed down writing and deploying code. Migrating monolithic repository to a package-based monorepo managed with technologies like Lerna and Nx. Introduced versioning, conventional commits, TypeDoc, Gitlab CI pipeline and many more things.",
    "Professor": "Computer Science Professor",
    "Computer Consultant": "Computer Consultant",
    "Resume.StreetGorilla": "In my role, I've been deeply involved in the analysis, development, and maintenance of their website, ensuring it's not only functional but also up-to-date and user-friendly. This work extends to their e-commerce platform, where similar efforts are applied to provide a seamless online shopping experience for their customers. Additionally, I've taken on the development of customized management software, tailored specifically to meet the unique needs of their business operations. A significant part of my responsibilities included the Automation, which involved transforming traditional, manual processes into efficient, digital ones. Furthermore, I provided ongoing technical support, ensuring smooth operations and addressing any technical issues that arised in a timely and effective manner.",
    "Project based contract": "Project based contract",
    "Resume.Radicis":"Adding and modifying features to the e-commerce platform (Magento).",
    "Web developer": "Web developer",
    "Resume.Encodata":"Development of a platform for service management and customer support. Including analysis of customer needs and subsequent final installation of the product.",
    "The beginning": "The beginning",
    "Resume.Beginning":"Since my childhood, I have been typing on a keyboard and wrote my first lines of code for an online video game in middle school. At the same time, at the age of 14, I created a social network as my first personal project. It was functional but never really launched online. Then, just a year later, I had the opportunity to develop a standalone application at Encodata S.p.A., which is still distributed and in use today.",
    "Portfolio.Description":"A selection of my most recent and significant works.",
    "Embedded Systems": "Embedded Systems",
    "Other": "Other",
    "Projects":"Projects",
    "Websites":"Websites",
    "Services.Websites.Description":"Do you need to create your own intuitive and professional website for yourself or your company?",
    "Contact me": "Contact me",
    "Services.Development":"Ad hoc Software Development",
    "Services.Development.Description":"Do you have an innovative idea or special needs to develop?",
    "Automation": "Automation",
    "Services.Digitalization.Description":"Do you have mechanical work that you repeat periodically? Copying, editing and pasting data from one place to another can be done by a machine, save your precious time.",
    "Consultancy": "Consultancy",
    "Services.Consultancy.Description":"Are you a company and need a professional opinion or analysis?",
    "Private Lessons": "Private Lessons",
    "Services.Lessons.Description":"Do you need to prepare for an exam or do you simply want to know more about the world of IT?",
    "Products and Applications":"Products and Applications",
    "Services.Products.Description":"Do you need to manage sales, purchases, inventory, invoicing, expenses, events, projects, points of sale, contracts, holidays, e-learning and/or much more? Discover the products already designed and developed to make you more productive.",
    "Location": "Location",
    "Name": "Name",
    "Email": "Email",
    "Message": "Message",
    "Subject": "Subject",
    "Send": "Send message",
    "Sent Successfully": "Your Message was sent successfully. Thank you!",
    "Contact.Error": "An error occurred while sending your message. Please try again later.",
    "Info": "Info",
    "Portfolio.Location":"Location",
    "Portfolio.Date": "Date",
    "Portfolio.Presentation": "Presentation",
    "Interview": "Interview",
    "Show": "Show",
    "ClearTheSmartCity.Description": "Developed an innovative \"smart bin\" project that interfaces with a database to track waste levels, emptying schedules, and other data for efficient waste management. This system includes a user-friendly web and mobile app for real-time monitoring of bin capacity, optimizing waste collection schedules, and reducing fuel consumption. Features include fill-level sensors, a waste-compacting mechanism, GPS tracking, and a GPRS/GSM board for data transmission, all designed with user safety and cost-effectiveness in mind, with hardware costs under €90.",
    "DermatologaVenezia.Description": "A sleek, user-friendly site for Dr. Rossana Capezzera, showcasing dermatological services with a CMS for easy content management by the owner. This project highlights my skills in creating accessible, efficiently navigable websites with a focus on client and patient engagement.",
    "GorillaEars.Description":"The core idea was to create a functional yet unobtrusive attachment that could be mounted at ear height on a helmet. The pieces were modeled in Blender, fitting perfectly on the lace of the helmet, ensuring a secure fit. The primary function of these attachments was to provide anchor points for a COVID-19 mask, thereby allowing users to wear masks comfortably without having to uncover their ears or adjust the helmet fit.",
    "Specification": "Specification",
    "Report": "Report",
    "Logisim Circuit": "Logisim Circuit",
    "MIPS.Description":"The project involves creating a 32-bit RISC architecture, inspired by the MIPS architecture, featuring a reduced instruction set architecture (ISA) and an ALU for integer number processing. Instructions are entered into the Instruction Register through Logisim's editor. Upon activating the clock, the instructions are executed sequentially until the last one in the IR. To demonstrate functionality, a program is loaded that inserts 6 elements into the main memory, each 4 bytes in the form of an array. It places an element k in register $a1, scans the array, and sets register $v0 to 1 if the element k is found, 0 otherwise.",
    "StreetGorilla.Description":"A dynamic web solution combining a robust Prestashop e-commerce platform with, at that time, an innovative coaching management application (using Laravel + Voyager). This project also features a cross-platform customer app (built with Ionic), Automation including a custom Chrome extension for streamlined e-commerce operations, and dedicated tech support, encapsulating a full spectrum of digital commerce and coaching services. Pretty most of the site regarding the gym business is customizable by the owners through a cms."
}
