{
    "About": "About",
    "Resume": "Resume",
    "Services":"Services",
    "Contact": "Contact",
    "Summary": "Summary",
    "Education": "Education",
    "Resume.Today": "Today",
    "Currently working as": "Currently working as",
    "Currently in Italy": "Currently in Italy",
    "at": "at",
    "Summary.Description": "With a decade of experience in software development and in the IT world, I have been able to touch every corner of this world, starting from the development of websites, to mobile applications, to the creation of small embedded systems.",
    "About.Description": "Graduated with full marks in Computer Science from the University of Milan. I worked for years, during my school and academic studies, as a freelancer on behalf of companies and private individuals. At the same time I had the opportunity to experiment with new technologies in my free time, ranging across various areas of the sector from web apps to embedded systems. I currently hold the position of technical lead at Zerouno S.r.l., where I keep myself constantly updated day by day, leading a team of developers in their professional growth and taking care of implementing architectural solutions that increase company productivity and efficiency. Sideways as a hobby, I am fascinated by following the financial markets, in particular the technological sector, increasingly trying to understand what the factors that move them are and how to analyze them. Since I was a child I have always been curious, competitive and hungry both in the sporting and personal fields, I have never been satisfied with the goals achieved and it is probably also due to these characteristics that, just mentioning the professional field, I have achieved relevant corporate positions at 23 years old and completed dozens of projects.",
    "Resume.ML": "Following the first introductory course on machine learning, I am currently taking a second Google course on generative artificial intelligence.",
    "Resume.Degree": "Bachelor Degree in Computer Science",
    "University of Milan": "University of Milan",
    "Resume.Degree.Description": "After receiving a scholarship for the results achieved during the first academic year (2018-2019), I obtained, in 2021, a degree with full marks in Computer Science from the University of Milan.",
    "Professional Experience": "Professional Experience",
    "Resume.Freelancer": "Freelancer",
    "Resume.Zerouno": "Tech Lead and Software Architect mainly involved on teaching the right approach to coding and problem solving to junior devs and on maintaining and improving Zerouno major product named JPuzzle. Eliminating overengineered code that slowed down writing and deploying code. Migrating monolithic repository to a package-based monorepo managed with technologies like Lerna and Nx. Introduced versioning, conventional commits, TypeDoc, Gitlab CI pipeline and many more things.",
    "Professor": "Computer Science Professor",
    "Computer Consultant": "Computer Consultant",
    "Resume.StreetGorilla": "In my role, I've been deeply involved in the analysis, development, and maintenance of their website, ensuring it's not only functional but also up-to-date and user-friendly. This work extends to their e-commerce platform, where similar efforts are applied to provide a seamless online shopping experience for their customers. Additionally, I've taken on the development of customized management software, tailored specifically to meet the unique needs of their business operations. A significant part of my responsibilities included the Automation, which involved transforming traditional, manual processes into efficient, digital ones. Furthermore, I provided ongoing technical support, ensuring smooth operations and addressing any technical issues that arised in a timely and effective manner.",
    "Project based contract": "Project based contract",
    "Resume.Radicis":"Adding and modifying features to the e-commerce platform (Magento).",
    "Web developer": "Web developer",
    "Resume.Encodata":"Development of a platform for service management and customer support. Including analysis of customer needs and subsequent final installation of the product.",
    "The beginning": "The beginning",
    "Resume.Beginning":"Since my childhood, I have been typing on a keyboard and wrote my first lines of code for an online video game in middle school. At the same time, at the age of 14, I created a social network as my first personal project. It was functional but never really launched online. Then, just a year later, I had the opportunity to develop a standalone application at Encodata S.p.A., which is still distributed and in use today.",
    "Portfolio.Description":"A selection of my most recent and significant works.",
    "Embedded Systems": "Embedded Systems",
    "Other": "Other",
    "Projects":"Projects",
    "Websites":"Websites",
    "Services.Websites.Description":"Do you need to create your own intuitive and professional website for yourself or your company?",
    "Contact me": "Contact me",
    "Services.Development":"Ad hoc Software Development",
    "Services.Development.Description":"Do you have an innovative idea or special needs to develop?",
    "Automation": "Automation",
    "Services.Digitalization.Description":"Do you have mechanical work that you repeat periodically? Copying, editing and pasting data from one place to another can be done by a machine, save your precious time.",
    "Consultancy": "Consultancy",
    "Services.Consultancy.Description":"Are you a company and need a professional opinion or analysis?",
    "Private Lessons": "Private Lessons",
    "Services.Lessons.Description":"Do you need to prepare for an exam or do you simply want to know more about the world of IT?",
    "Products and Applications":"Products and Applications",
    "Services.Products.Description":"Do you need to manage sales, purchases, inventory, invoicing, expenses, events, projects, points of sale, contracts, holidays, e-learning and/or much more? Discover the products already designed and developed to make you more productive.",
    "Location": "Location",
    "Name": "Name",
    "Email": "Email",
    "Message": "Message",
    "Subject": "Subject",
    "Send": "Send message",
    "Sent Successfully": "Your Message was sent successfully. Thank you!",
    "Contact.Error": "An error occurred while sending your message. Please try again later.",
    "Info": "Info",
    "Portfolio.Location":"Location",
    "Portfolio.Date": "Date",
    "Portfolio.Presentation": "Presentation",
    "Interview": "Interview",
    "Show": "Show",
    "ClearTheSmartCity.Description": "Developed an innovative \"smart bin\" project that interfaces with a database to track waste levels, emptying schedules, and other data for efficient waste management. This system includes a user-friendly web and mobile app for real-time monitoring of bin capacity, optimizing waste collection schedules, and reducing fuel consumption. Features include fill-level sensors, a waste-compacting mechanism, GPS tracking, and a GPRS/GSM board for data transmission, all designed with user safety and cost-effectiveness in mind, with hardware costs under €90.",
    "DermatologaVenezia.Description": "A sleek, user-friendly site for Dr. Rossana Capezzera, showcasing dermatological services with a CMS for easy content management by the owner. This project highlights my skills in creating accessible, efficiently navigable websites with a focus on client and patient engagement.",
    "GorillaEars.Description":"The core idea was to create a functional yet unobtrusive attachment that could be mounted at ear height on a helmet. The pieces were modeled in Blender, fitting perfectly on the lace of the helmet, ensuring a secure fit. The primary function of these attachments was to provide anchor points for a COVID-19 mask, thereby allowing users to wear masks comfortably without having to uncover their ears or adjust the helmet fit.",
    "Specification": "Specification",
    "Report": "Report",
    "Logisim Circuit": "Logisim Circuit",
    "MIPS.Description":"The project involves creating a 32-bit RISC architecture, inspired by the MIPS architecture, featuring a reduced instruction set architecture (ISA) and an ALU for integer number processing. Instructions are entered into the Instruction Register through Logisim's editor. Upon activating the clock, the instructions are executed sequentially until the last one in the IR. To demonstrate functionality, a program is loaded that inserts 6 elements into the main memory, each 4 bytes in the form of an array. It places an element k in register $a1, scans the array, and sets register $v0 to 1 if the element k is found, 0 otherwise.",
    "StreetGorilla.Description":"A dynamic web solution combining a robust Prestashop e-commerce platform with, at that time, an innovative coaching management application (using Laravel + Voyager). This project also features a cross-platform customer app (built with Ionic), Automation including a custom Chrome extension for streamlined e-commerce operations, and dedicated tech support, encapsulating a full spectrum of digital commerce and coaching services. Pretty most of the site regarding the gym business is customizable by the owners through a cms.",
    "Message sent successfully!": "Message sent successfully!",
    "Error sending message, please try again later.": "Error sending message, please try again later.",
    "Back to projects": "Back to projects",
    "weeks":"weeks",

    "Coreve.ProjectTitle": "CoReVe Project for Tender Digitization",
    "Coreve.ProjectDetails": "Project Details",
    "Coreve.Date": "Date",
    "Coreve.ProjectDuration": "Project Duration",
    "Coreve.TechnologiesUsed": "Technologies Used",
    "Coreve.Team": "Team",
    "Coreve.MyRole": "My Role",
    "Coreve.ProjectDescription": "Project Description",
    "Coreve.ProjectDescriptionText": "In this innovative project, our goal was to transform CoReVe's traditionally paper-based processes into an efficient and intuitive digital system that simplified the tender subscription procedure. We were tasked with developing a system for creating digital tenders, aimed at municipalities, entities, and companies. The main challenge was to digitize existing paper forms into dynamic forms, simplifying the compilation process and significantly reducing formal errors through automatic validation functions.",
    "Coreve.FeaturesAndResults": "Features and Results",
    "Coreve.Digitalization": "Digitalization",
    "Coreve.DigitalizationText": "Creation of dynamic forms that guide the user through an intuitive and intelligent compilation process, minimizing errors thanks to the system's automatic validation.",
    "Coreve.SecurityAndLegality": "Security and Legality",
    "Coreve.SecurityAndLegalityText": "Implementation of a system for generating PDF documents at the end of the compilation process, which can be digitally signed or printed for a manual signature, ensuring the legal validity of submissions.",
    "Coreve.TechnologicalInnovation": "Technological Innovation",
    "Coreve.TechnologicalInnovationText": "Use of advanced technologies such as NodeJS with Strapi for the backend, and Angular with PrimeNG for a customized frontend, in addition to the implementation of OIDC Authentication with Keycloak.",
    "Coreve.MyContribution": "My Contribution",
    "Coreve.MyContributionText": "As an integral part of the team, my role focused on laying the groundwork for architecture and code review. I quickly gained expertise in the new frameworks used, providing essential technical guidance to the team and ensuring the project's objectives were met within tight deadlines. Additionally, given my corporate role, I supported other developers and participated in meetings for parallel projects, demonstrating versatility and multi-project competence.",
    "Coreve.PriorityManagement": "Priority Management and Time Optimization",
    "Coreve.PriorityManagementText": "A crucial aspect of this project was the effective management of timelines. As the tender was an officially binding document with a set publication date and time, we had to adopt a strategic approach in managing tasks. To optimize time, we decided to postpone all backoffice operations that were not immediately necessary for the tender's publication. This allowed us to focus on the absolute priority: the development of the frontoffice part accessible by municipalities, entities, and companies. This decision ensured that we could meet the stringent deadline without compromising the quality and functionality of the system, demonstrating our ability to adapt effectively to client needs and time constraints.",
    "Coreve.TechMentor": "Technical Mentor",

    "jPuzzle.ProjectTitle": "Refactoring and Optimization of jPuzzle",
    "jPuzzle.Introduction": "Introduction",
    "jPuzzle.IntroductionText": "Upon joining Zerouno, I encountered their flagship product jPuzzle: an extremely modular ERP system that concealed several technical gaps behind an old-style but functional and pixel-perfect frontend.",
    "jPuzzle.InitialChallenge": "Initial Challenge",
    "jPuzzle.InitialChallengeText": "My first hands-on experience with the system immediately presented a challenge: excessively long compilation times. A simple 'ng serve' command required over five minutes to compile the application, a significant delay that caused each developer to lose a considerable amount of time for every small change made.",
    "jPuzzle.StrategiesAndSolutions": "Strategies and Solutions",
    "jPuzzle.TechnicalNote": "Technical Note",
    "jPuzzle.TechnicalNoteContent": "If you are a technician and would like to read a blog about it, you can find it here:",
    "jPuzzle.StrategiesList": "I began exploring ways to reduce compilation times, focusing on various configurations and optimizations. This process included:",
    "jPuzzle.RemovalOfUnnecessarySteps": "Removal of Unnecessary Steps in Development Mode",
    "jPuzzle.TsconfigReview": "Review of the Configuration File (tsconfig.json)",
    "jPuzzle.PackagingWithNx": "Packaging and Use of Nx",
    "jPuzzle.ApplicationOfKISS": "Application of the KISS Principle (Keep It Simple, Stupid)",
    "jPuzzle.Results": "Results",
    "jPuzzle.ResultsText": "Thanks to these strategies, I was able to reduce the compilation time from five minutes to just a few seconds, greatly improving efficiency and collaboration in development. This project demonstrated the importance of a flexible approach and critical thinking in solving technical problems.",
    "jPuzzle.RemovalOfUnnecessaryStepsDescription": "By examining the Angular compiler configuration, I identified and disabled some options that were slowing down the compilation, such as optimization and the generation of a single bundle.",
    "jPuzzle.TsconfigReviewDescription": "I analyzed and optimized the TypeScript configuration file to ensure that only the necessary files were included in the compilation.",
    "jPuzzle.PackagingWithNxDescription": "Facing the complexity of a large monolithic application, I adopted the approach of dividing it into smaller, more manageable npm packages, using Nx for efficient management. This allowed for incremental and parallel compilation, drastically reducing compilation times.",
    "jPuzzle.ApplicationOfKISSDescription": "An important lesson learned was the simplification of the code. By eliminating overengineering and reducing the amount of code, I was able to maintain 100% of the functionality removing a big quantity of the existing legacy code (following the Pareto principle).",

    "ZerounoOptimization.Title": "Frontend Optimization in Zerouno",
    "ZerounoOptimization.Introduction": "Introduction",
    "ZerounoOptimization.IntroText": "When I joined Zerouno, I saw the immense effort put into having a frontend that, despite being quite old-style, was extremely modular, composable, and at the same time rigid in the graphic customizations which had to meet certain usability and company coherence standards. I was pleasantly shocked to see that at first glance, not a single pixel was out of place, and it seemed to me that I had stumbled upon something from which I could learn a lot (spoiler: that was the case, but in the \"hard way\")... I distinctly remember that after seeing and trying it firsthand, I compiled a frontend application for the first time.",
    "ZerounoOptimization.CompilationTimeDiscussion": "\"It must be just the first compilation, let's see how it behaves with incremental builds\", we add a console.log somewhere and save, let's see what happens with live reloading... still minutes of compilation... shocked, I turned to the nearest colleague:",
    "ZerounoOptimization.Dialogue1": "\"is it normal that it takes minutes to compile every time I add a ';'?\"",
    "ZerounoOptimization.Dialogue2": "\"yes, it's a bit slow\"",
    "ZerounoOptimization.StudyOnCompilation": "From there, I began my study to incrementally find ways to reduce compilation times. SPOILER: there is no magic or magical flag, the truth lies in the last two sections.",
    "ZerounoOptimization.ArticleNote": "Note: This article was written more than a year after the start of this transformation, so it may contain historical/technical inaccuracies and does not contain statistical reports on the operations described below but aims to provide an overview of the reasoning and the journey that led to transforming an application that was extremely difficult to maintain and unnecessarily large in terms of file quantity and size into one with the same set of features but optimized in several aspects.",
    "ZerounoOptimization.RemovalOfUnnecessarySteps": "Removal of Unnecessary Steps in Development Mode Compilation",
    "ZerounoOptimization.RemovalDescription": "Starting with the ways that took less effort to speed up the compilation process, I thought to see what the compiler offered in terms of configuration to improve the situation...",
    "ZerounoOptimization.AotDescription": "aot: Use AOT as long as you can; compared to the other flags mentioned subsequently, it is the only one I recommend keeping enabled (true)...",
    "ZerounoOptimization.OptimizationDescription": "optimization: Inserts steps for scripts and style sheets minification...",
    "ZerounoOptimization.BuildOptimizerDescription": "buildOptimizer: Angular's documentation does not provide much information on what this flag does...",
    "ZerounoOptimization.VendorChunkDescription": "vendorChunk: Generates a separate bundle containing only third-party modules...",
    "ZerounoOptimization.CompilationMisconception": "Despite these interesting precautions, in my experience, they are NOT the causes of slow compilation in an Angular application. The Angular compiler is actually very fast, and the basic setup provided by the auto-generated configuration file when running 'ng new app' is more than adequate. 9 out of 10 times, the problem falls on other architectural or configuration issues.",
    "ZerounoOptimization.TsconfigAndAngularJson": "tsconfig.json and Existential Conflicts with angular.json",
    "ZerounoOptimization.TsconfigExplanation": "As long as you come from a clean Angular project generated with 'ng new ...', you can be fairly certain that the tsconfig.json file you find is okay for your needs. But if, like me, you are thrown into an already existing project with thousands of files, it's not a bad idea to give it a check.",
    "ZerounoOptimization.IncrementalFlag": "incremental: in TypeScript, setting this flag to true results in incremental builds that speed up subsequent builds after the first one, both in terms of live reloading and cold starts from disk. Angular seems to ignore this flag, and as for live reloading, the Angular compiler already tries to recompile only the modified code (plus its dependencies), but this does not happen for cold starts from disk.",
    "ZerounoOptimization.FilesIncludeExclude": "files, include, exclude: Carefully checking which files are included or excluded from compilation can have a significant impact on compilation time. Maybe having { 'include': ['**/*.ts'] } is not a great idea. In particular, in a standard Angular application, you should not need to specify which files to compile inside tsconfig.json, but rather specify the entry point in the projects.<projectname>;.architect.build.options.main property",
    "ZerounoOptimization.Packaging": "Packaging",
    "ZerounoOptimization.PackagingDescription": "We arrive at one of the key points in the journey where we need to get our hands dirty: packaging. One of the biggest challenges developers face when working with a monolithic application, especially as the application grows to over 8000 files with hundreds of lines of TypeScript code, is the slowness of the compilation process.",
    "ZerounoOptimization.NxToTheRescue": "Nx to the Rescue",
    "ZerounoOptimization.NxDescription": "Briefly, Nx is an extremely powerful tool that, among other things, allows developers to organize code in a monorepo, with the ability to logically divide it into shared libraries. These libraries can be managed as separate npm packages, allowing for more granular code management.",
    "ZerounoOptimization.NxLink": "https://nx.dev/getting-started/why-nx",
    "ZerounoOptimization.HowToTransform": "Getting to the Point: How Do I Transform a Monolithic Source into Packages?",
    "ZerounoOptimization.TransformDescription": "Proceeding step by step, I began by identifying the parts of the code that could be logically separated. Fortunately, the source was already well divided into folders with their scopes (ui, renderers, i18n, utils, etc.), the challenge then was to eliminate an intricate 'labyrinth' of dependencies with each other (but this is another story). Using Nx, I created npm packages for each library. Each package had its own set of dependencies and could be compiled separately. At this point, for each created package, I removed the respective code in the repository where the applications were present along with the remaining libraries still connected in a monolithic way and patched here and there some remnants to make everything work.",
    "ZerounoOptimization.HowItWorks": "Nice... But Really... How Does It Work?",
    "ZerounoOptimization.HowItWorksDescription": "The magic of packaging lies in incremental compilation. Through an intelligent caching system that stores the results of the compilation, instead of recompiling the entire monolith every time a change is made, Nx allows the compilation of only the packages that have actually been modified or parts that depend on them. If a library has not been modified, Nx simply uses the cached version. Furthermore, given that we have a well-defined dependency tree, Nx also allows the parallel compilation of packages. This means that, where possible, multiple libraries can be compiled simultaneously.",
    "ZerounoOptimization.KISSPattern": "Generalization and Many Kisses (KISS Pattern)",
    "ZerounoOptimization.KISSDescription": "The secret and mantra I like to say I brought into zerouno is 'Simplify and eliminate'. The truth and the real difference in compilation times, maintainability, etc., lies in greatly simplifying an overengineered source structure, eliminating dozens and dozens of files and thousands of lines of code. Of course, this should not be done randomly but requires careful consideration of any potential breaking changes, levels of abstraction to be maintained, and all this, if you're (un)lucky like me, without any line of testing to check that what you are doing does not break scattered logics throughout the application.",
    "ZerounoOptimization.ParetoPrinciple": "So, after eliminating here and there, making refactor upon refactor of methods, classes, etc., having an almost perfect understanding of all the gears that move the application, and with the boss's blessing, you can proceed to gather an idea of how to apply the Pareto principle to your own application context, seeking to achieve 80% of the existing functionality with 20% of the effort.",
    "ZerounoOptimization.CommentsWelcome": "Comments are welcome:",

    "Loading": "Loading..."
}
