{
    "About": "Chi sono",
    "Resume": "Curriculum",
    "Services": "Servizi",
    "Contact": "Contatti",
    "Summary": "Riepilogo",
    "Education": "Formazione",
    "Resume.Today": "ad Oggi",
    "Currently working as": "Attualmente impiegato come",
    "Currently in Italy": "Attualmente in Italia",
    "at": "presso",
    "Summary.Description":"Con un'esperienza decennale nello sviluppo software e nel mondo dell'informatica, ho potuto toccare, ogni angolo di questo mondo, a partire dallo sviluppo di siti web, alle applicazioni mobile, alla creazione di piccoli sistemi embedded.",
    "About.Description": "Laureato a pieni voti in Informatica presso l'Università degli Studi di Milano. Ho lavorato per anni, durante gli studi scolastici e accademici, come freelancer per conto di aziende e privati. Allo stesso tempo ho avuto modo di sperimentare nel tempo libero nuove tecnologie, spaziando fra i vari ambiti del settore da web app a sistemi embedded. Attualmente ricopro la posizione di technical lead presso Zerouno SRL, dove mantenendomi costantemente aggiornato giorno per giorno, seguo un team di sviluppatori nella loro crescita professionale e mi preoccupo di implementare soluzioni architetturali che aumentino la produttività e l'efficienza aziendale. Lateralmente come hobby, mi affascina seguire i mercati finanziari, in particolare il settore tecnologico, cercando sempre di più di capire quali siano i fattori che li smuovono e come analizzarli. Sin da piccolo sono sempre stato curioso, competitivo e affamato sia in ambito sportivo che personale, non mi sono mai accontentato dei traguardi raggiunti ed è probabilmente anche per queste caratteristiche che, solo citando l'ambito professionale, ho raggiunto posizioni aziendali rilevanti alla sola età di 23 anni e portato a termine decine di progetti.",
    "Resume.ML":"A seguito del primo corso introduttivo sul machine learning, attualmente sto seguendo un secondo corso Google sull'intelligenza artificiale generativa.",
    "Resume.Degree":"Laurea in Informatica",
    "University of Milan":"Università degli Studi di Milano",
    "Resume.Degree.Description":"Dopo aver ricevuto una borsa di studio per i risultati raggiunti durante il I anno accademico (2018-2019), ho conseguito, nel 2021, una Laurea a pieni voti in Informatica presso l'Università degli Studi di Milano Statale.",
    "Professional Experience": "Esperienza Professionale",
    "Resume.Freelancer":"Libero professionista",
    "Resume.Zerouno": "Tech Lead principalmente occupato nell'insegnamento del giusto approccio alla scrittura del codice e al problem solving nei confronti degli sviluppatori junior e al mantenimento e al miglioramento del prodotto principale di Zerouno denominato JPuzzle. Eliminando sovraingegnerizzazioni che rallentavano la scrittura e la distribuzione del software. Tra i vari miglioramenti mi sono occupato di migrare l'intero repository monolitico a un monorepo package-based gestito con tecnologie come Lerna e Nx. Ho introdotto il controllo delle versioni, i commit convenzionali, TypeDoc, pipeline di CI Gitlab e molte altre cose.",
    "Professor": "Professore di Informatica",
    "Computer Consultant": "Consulente Informatico",
    "Resume.StreetGorilla": "Nel mio ruolo, sono stato profondamente coinvolto nell'analisi, sviluppo e manutenzione del sito web, assicurandomi che fosse non solo funzionale ma anche aggiornato e facile da usare. Questo lavoro si estende alla piattaforma e-commerce, dove sforzi simili sono applicati per fornire un'esperienza di acquisto online fluida ai loro clienti. Inoltre, ho intrapreso lo sviluppo di software gestionale personalizzato, su misura per soddisfare le esigenze uniche delle loro operazioni aziendali. Una parte significativa delle mie responsabilità ha incluso la digitalizzazione dei processi aziendali, trasformando i processi tradizionali e manuali in processi digitali ed efficienti. Inoltre, ho fornito supporto tecnico continuativo, assicurando un'operatività aziendale continua e affrontando qualsiasi problema tecnico in modo tempestivo ed efficace.",
    "Project based contract": "Contratto a progetto",
    "Resume.Radicis":"Aggiunta e modifica di funzionalità a piattaforma di e-commerce (Magento).",
    "Web developer": "Sviluppatore web",
    "Resume.Encodata":"Sviluppo di una piattaforma per la gestione dell'assistenza e il supporto clienti. Comprensivo di analisi delle esigenze del cliente e successiva installazione finale del prodotto.",
    "The beginning": "L'inizio",
    "Resume.Beginning": "Digitando sulla tastiera sin da quando ero bambino, ho scritto le mie prime righe di codice per lo sviluppo di un videogioco online in 3° media. Nello stesso periodo, all'età di 14 anni, ho realizzato un social network come mio primo progetto personale, funzionante ma mai realmente portato online. Ho avuto poi la possibilità di sviluppare, solo un anno dopo, un applicativo in solitaria presso Encodata S.p.A. distribuito e ancora oggi utilizzato.",
    "Portfolio.Description":"Solo alcuni dei lavori svolti negli ultimi anni.",
    "Embedded Systems": "Sistemi Embedded",
    "Other": "Altro",
    "Projects":"Progetti",
    "Websites": "Sviluppo web",
    "Services.Websites.Description":"Hai bisogno di creare il tuo sito web intuitivo e professionale per te o per la tua azienda?",
    "Contact me": "Contattami",
    "Services.Development":"Sviluppo software ad hoc",
    "Services.Development.Description":"Hai un'idea innovativa o necessità particolari da sviluppare?",
    "Automation": "Automazione",
    "Services.Digitalization.Description":"Hai un lavoro meccanico da ripetere periodicamente? Copiare, modificare e incollare i dati da una parte all'altra può farlo una macchina, risparmia il tuo tempo prezioso.",
    "Consultancy": "Consulenza",
    "Services.Consultancy.Description":"Sei un'azienda e hai bisogno di un opinione professionale o di un'analisi?",
    "Private Lessons": "Lezioni private",
    "Services.Lessons.Description":"Devi preparare un esame o semplicemente vuoi saperne di più sul mondo dell'informatica?",
    "Products and Applications":"Prodotti e Applicazioni",
    "Services.Products.Description":"Hai bisogno di gestire vendite, acquisti, magazzino, fatturazione, spese, eventi, progetti, punti vendita, contratti, ferie, e-learning e/o molto altro? Scopri i prodotti già pensati e sviluppati per renderti più produttivo.",
    "Location": "Luogo",
    "Name": "Nome",
    "Email": "Email",
    "Message": "Messaggio",
    "Subject": "Oggetto",
    "Send": "Invia messaggio",
    "Sent Successfully": "Il tuo messaggio è stato inviato. Grazie!",
    "Contact.Error": "Si è verificato un errore durante l'invio del messaggio. Riprova più tardi.",
    "Info": "Informazioni",
    "Portfolio.Location":"Presso",
    "Portfolio.Date":"Data",
    "Portfolio.Presentation": "Presentazione",
    "Interview": "Intervista",
    "Show": "Visuallizza",
    "ClearTheSmartCity.Description": "Ho sviluppato un progetto innovativo di \"cestino intelligente\" che si interfaccia con un database per monitorare i livelli di rifiuti, le programmazioni di svuotamento e altri dati per una gestione efficiente dei rifiuti. Il sistema include un'app web e mobile facile da usare per il monitoraggio in tempo reale della capacità dei bidoni, ottimizzando i programmi di raccolta dei rifiuti e riducendo il consumo di carburante. Le caratteristiche includono sensori di livello di riempimento, un meccanismo di compattazione dei rifiuti, tracciamento GPS e una scheda GPRS/GSM per la trasmissione dei dati, tutto progettato tenendo in mente la sicurezza dell'utente e il risparmio dei costi, con costi hardware inferiori a 90 €.",
    "DermatologaVenezia.Description":"Un sito elegante e facile da usare per la Dott.ssa Rossana Capezzera, che mostra i servizi dermatologici che effettua e gli ambulatori in cui opera. I contenuti sono facilmente e autonomamente gestiti da parte del proprietario tramite un CMS. Il sito web risulta quindi accessibile e navigabile in modo efficiente con particolare attenzione al coinvolgimento del cliente e del paziente.",
    "GorillaEars.Description":"L'idea centrale era quella di creare un accessorio funzionale ma discreto che potesse essere montato all'altezza delle orecchie su un casco. I pezzi sono stati modellati in Blender, adattandosi perfettamente ai lacci del casco, garantendo una vestibilità sicura. La funzione principale di questi attacchi era quella di fornire punti di ancoraggio per una maschera COVID-19, consentendo così agli utenti di indossarla comodamente senza dover scoprire le orecchie o regolare la vestibilità del casco.",
    "Specification": "Specifica",
    "Report":"Relazione",
    "Logisim Circuit": "Circuito Logisim",
    "MIPS.Description":"Il progetto consiste nella realizzazione di un’architettura RISC a 32bit, prendendo spunto dall’architettura MIPS, con ISA ridotto e un’ALU ad elaborazione di numeri interi. Le istruzioni vengono inserite nell’Istruction Register tramite l’editor di logisim. Una volta attivato il clock, le istruzioni vengono eseguite in cascata fino all’ultima disponibile nell’IR. Al fine di dimostrare il funzionamento viene caricato un programma che inserisce 6 elementi in memoria centrale, da 4 byte ciascuno sotto forma di array, un elemento k nel registro $a1, scansiona l’array e inserisce nel registro $v0: 1 se è stato trovato l’elemento k, 0 altrimenti.",
    "StreetGorilla.Description":"Una soluzione web dinamica che combina una robusta piattaforma e-commerce Prestashop con, a quel tempo, un'applicazione innovativa per la gestione del coaching (usando Laravel + Voyager). Questo progetto include anche un'app cliente multipiattaforma (sviluppata con Ionic), la digitalizzazione dei processi aziendali inclusa un'estensione Chrome personalizzata per semplificare le operazioni di e-commerce, e supporto tecnico dedicato, racchiudendo un ampio spettro di servizi digitali di commercio e coaching. Gran parte del sito relativo all'attività di palestra è personalizzabile dai proprietari tramite un CMS."
}
